Repository: 2448986301/AggieGPA
Catalog: AggieGPA/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %.1f tokens/s
zh_hans: %.1f 个词元/秒

source: %.2f s
zh_hans: %.2f 秒

# %@ · %@ pts
source: %1$@ · %2$@ pts
zh_hans: %1$@ · %2$@ 分

source: %@ assumed percentage
zh_hans: %@ 的试算百分比

source: %@ assumption
zh_hans: %@ 的试算设置

source: %@ currently contributes the most to this grade.
zh_hans: 目前，%@ 对总成绩的贡献最大。

source: %@ day(s) before
zh_hans: 提前 %@ 天

source: %@ does not have an explicit weight.
zh_hans: %@ 没有明确的权重。

source: %@ graded progress
zh_hans: %@ 已评分进度

source: %@ has a high course impact
zh_hans: %@ 对课程总评影响较大

source: %@ has an invalid drop rule.
zh_hans: %@ 的丢弃最低分规则无效。

source: %@ has an invalid multiplier.
zh_hans: %@ 的计分倍数无效。

source: %@ has an invalid weight.
zh_hans: %@ 的权重无效。

source: %@ has no recorded score and its due date has passed.
zh_hans: %@ 尚未记录成绩，且截止日期已过。

source: %@ has no urgent academic alerts
zh_hans: %@ 暂无需要立即处理的学业提示

source: %1$@ has the highest remaining impact and could affect up to %2$@ of the course result.
zh_hans: %1$@ 是剩余项目中影响最大的一项，最多可影响课程总评的 %2$@。

source: %@ hour(s) before
zh_hans: 提前 %@ 小时

source: %@ is at %@, more than 10 points below the %@ target.
zh_hans: %@ 当前为 %@，比 %@ 目标低超过 10 个百分点。

source: %@ is below the course target
zh_hans: %@ 低于课程目标

source: %@ is due soon
zh_hans: %@ 即将截止

source: %@ is graded but has no score.
zh_hans: %@ 已标记为已评分，但尚未录入分数。

source: %@ is marked missing
zh_hans: %@ 已标记为缺交

source: %@ is overdue
zh_hans: %@ 已逾期

source: %@ needs possible points greater than zero.
zh_hans: %@ 的满分必须大于 0。

# %@ of %@
source: %1$@ of %2$@
zh_hans: %@（共 %@）

source: %@ of the course weight has graded work.
zh_hans: 目前已有 %@ 的课程权重完成评分。

source: %@ override
zh_hans: 覆盖成绩：%@

source: %@ points
zh_hans: %@ 分

source: %@ possible points
zh_hans: %@ 可得分

source: %@ units
zh_hans: %@ 学分

source: %@ uses a custom rule requiring manual review.
zh_hans: %@ 使用了自定义规则，需要手动检查。

# %@, calculated current grade %@, official grade %@
source: %1$@, calculated current grade %2$@, official grade %3$@
zh_hans: %@，计算的当前成绩 %@，正式成绩 %@

source: %@%% and above
zh_hans: %@%% 及以上

source: %@%% graded
zh_hans: %@%% 已评分

source: %1$lld%% · %2$@ of %3$@
zh_hans: %1$lld%% · 已下载 %2$@ / %3$@

source: %lld assignments and exams
zh_hans: %lld 项作业和考试

source: %lld categories
zh_hans: %lld 个类别

# %lld categories · %@
source: %1$lld categories · %2$@
zh_hans: %1$lld 个类别 · %2$@

source: %lld grade scale levels
zh_hans: %lld 个成绩等级

# %lld graded · %lld ungraded
source: %1$lld graded · %2$lld ungraded
zh_hans: %lld 已评分 · %lld 未评分

source: %lld grading categories
zh_hans: %lld 个评分类别

source: %lld grading rules
zh_hans: %lld 条评分规则

source: %lld items need your attention
zh_hans: 有 %lld 项内容需要你确认

source: %lld percent
zh_hans: %lld 百分比

# %lld percent assumed for %@
source: %1$lld percent assumed for %2$@
zh_hans: 将“%2$@”按 %1$lld%% 试算

source: %1$lld quarters, %2$lld courses, and %3$lld scenarios. Potential duplicates: %4$lld quarters and %5$lld courses.
zh_hans: %lld 个学期、%lld 门课程和 %lld 个方案。可能重复：%lld 个学期和 %lld 门课程。

source: %lld selected
zh_hans: 已选 %lld 项

source: %lld sources found
zh_hans: 找到 %lld 条依据

source: + Add
zh_hans: + 添加

source: + Add Assignment
zh_hans: + 添加作业

source: + Add Exam
zh_hans: + 添加考试

source: 1 day before
zh_hans: 提前 1 天

source: 1 item needs your attention
zh_hans: 有 1 项内容需要你确认

source: 1 minute
zh_hans: 1 分钟

source: 1 source found
zh_hans: 找到 1 条依据

source: 1 week before
zh_hans: 提前 1 周

source: 3 days before
zh_hans: 提前 3 天

source: 5 minutes
zh_hans: 5 分钟

source: A %1$@ score on %2$@ could bring the projected course grade to approximately %3$@, with other forecast assumptions unchanged.
zh_hans: 在“%2$@”中取得 %1$@，在其他预测假设不变的情况下，预计课程成绩可达到约 %3$@。

source: A best-N-of-M rule contains impossible values.
zh_hans: 有一条“取 M 项中的最高 N 项”规则包含无效数值。

source: A best-N-of-M rule is mentioned and requires manual review.
zh_hans: 检测到最佳 N 项中的 M 项规则，需要手动审核。

source: A bonus or extra-credit rule is mentioned; confirm its limit and denominator.
zh_hans: 检测到奖励分或额外加分规则，请确认上限和分母。

source: A calmer, clearer way to stay on top of your grades.
zh_hans: 用更从容、更清晰的方式掌握成绩进度。

source: A calmer, more consistent way to track your grades.
zh_hans: 以更从容、更一致的方式记录成绩。

source: A category has a percentage outside 0–100%.
zh_hans: 有一个类别的百分比不在 0–100% 范围内。

source: A complete grading method was not found.
zh_hans: 未找到完整的评分方式。

source: A custom grading scale is mentioned but its boundaries were not fully recognized.
zh_hans: 检测到自定义评分等级，但未能完整识别其边界。

source: A draft is ready. Confirm it in Aggie GPA before it is saved.
zh_hans: 草稿已准备好，请先在 Aggie GPA 中确认再保存。

source: A drop-lowest count cannot be negative.
zh_hans: 去除最低分的数量不能为负数。

source: A grade-entry draft is ready. Confirm it in Aggie GPA before the score changes.
zh_hans: 录分草稿已准备好，请先在 Aggie GPA 中确认；分数尚未更改。

source: A grade-scale boundary is outside 0–100%.
zh_hans: 有一个等级分数线不在 0–100% 范围内。

source: A grading category has conflicting values in the syllabus.
zh_hans: 课程大纲中同一评分类别存在相互冲突的数据。

source: A grading category needs a name.
zh_hans: 有一个评分类别尚未填写名称。

source: A late-work policy is mentioned; confirm the deadline and penalty.
zh_hans: 检测到迟交作业政策，请确认截止时间和扣分规则。

source: A minimum-exam requirement is mentioned and requires manual review.
zh_hans: 检测到考试最低要求，需要手动审核。

source: A more reachable student-first grade workflow.
zh_hans: 更容易上手、以学生为先的成绩记录流程。

source: A new explanation shows how categories contribute to the current grade
zh_hans: 新增成绩解释，清楚展示各类别如何影响当前成绩

source: A percentage can still be calculated, but letter-target guidance needs a confirmed grade scale.
zh_hans: 仍可计算百分比，但字母成绩目标需要已确认的等级分数表。

source: A point total cannot be negative.
zh_hans: 总分不能为负数。

source: A secure connection to the model download could not be established. Try again or import the GGUF file from Files.
zh_hans: 无法与模型下载服务建立安全连接。请重试，或从“文件”导入 GGUF 模型。

source: A short list of work that can move today.
zh_hans: 今天可以推进的少量事项。

source: A weekday or calendar date is required.
zh_hans: 需要星期或日历日期。

source: A-minus
zh_hans: A−

source: A-minus Target
zh_hans: A− 目标

source: About
zh_hans: 关于

source: About 491 MB
zh_hans: 约 491 MB

source: Academic Calendar
zh_hans: 学业日历

source: Academic insight
zh_hans: 学业提示

source: Academic Insights
zh_hans: 学业提示

source: Academic Load
zh_hans: 学业负荷

source: Academic Term
zh_hans: 学期

source: Academic Timeline
zh_hans: 学业时间线

source: Academic year
zh_hans: 学年

source: Academic Year %@
zh_hans: 学年 %@

source: Academic year, e.g. 2026–2027
zh_hans: 学年，例如 2026–2027

source: Access
zh_hans: 访问权限

# Across %@ future units, you would need an average GPA of %@.
source: Across %1$@ future units, you would need an average GPA of %2$@.
zh_hans: 在未来 %@ 个学分中，你需要保持 %@ 的平均 GPA。

source: Action
zh_hans: 操作

source: Actions for %@
zh_hans: “%@”的操作

source: Active
zh_hans: 当前

source: Active Model
zh_hans: 当前模型

source: Adaptive layouts for portrait, landscape, Split View, keyboard, and pointer
zh_hans: 适配竖屏、横屏、分屏、键盘和指针操作

source: Add
zh_hans: 添加

source: Add a course first
zh_hans: 请先添加课程

source: Add a course forecast to see predicted GPA. Official GPA remains unchanged.
zh_hans: 添加课程预测后可查看预计 GPA；正式 GPA 不会改变。

source: Add a course from Today or a quarter.
zh_hans: 请从“今天”或学期页面添加课程。

source: Add a projected grade to reveal the highest-impact course change.
zh_hans: 添加预计成绩后，即可看到影响最大的课程变化。

source: Add a quarter and your first letter-graded course.
zh_hans: 添加一个学期和第一门字母评分课程。

source: Add a quarter first
zh_hans: 请先添加学期

source: Add a term and dated assignments to build your academic calendar.
zh_hans: 添加学期，并为作业或考试设置截止日期后即可查看学业日历。

source: Add a term and dated assignments to build your semester map.
zh_hans: 添加学期，并为作业或考试设置截止日期后即可查看学期进度。

source: Add a term first
zh_hans: 请先添加学期

source: Add actual course scores to see deterministic guidance.
zh_hans: 添加实际课程成绩后，这里会显示确定性计算结果。

source: Add an assignment or exam before recording a score.
zh_hans: 请先添加作业或考试，再录入成绩。

source: Add an assignment or exam when something is due.
zh_hans: 有截止任务时，添加作业或考试。

source: Add an assignment or exam when something needs your attention.
zh_hans: 有需要处理的事项时，添加作业或考试。

source: Add an ungraded assignment or exam to explore outcomes.
zh_hans: 添加一项未评分的作业或考试，即可推演结果。

source: Add another quarter to see a trend line
zh_hans: 再添加一个学期即可显示趋势线

source: Add Assignment
zh_hans: 添加作业

source: Add assignment or exam
zh_hans: 添加作业或考试

source: Add Category
zh_hans: 添加类别

source: Add Course
zh_hans: 添加课程

source: Add Courses
zh_hans: 添加课程

source: Add current courses or explore an isolated sample without changing your records.
zh_hans: 添加当前课程，或体验不会改动记录的独立示例。

source: Add due dates to see your semester unfold here.
zh_hans: 添加截止日期后，这里会展示你的学期进度。

source: Add Exam
zh_hans: 添加考试

source: Add Grade
zh_hans: 添加成绩

source: Add Grade Item
zh_hans: 添加作业或考试

source: Add grades to check the target
zh_hans: 添加成绩后查看目标

source: Add grading categories and scores first.
zh_hans: 请先添加评分类别和分数。

source: Add Missing Category
zh_hans: 添加缺失类别

source: Add planned course
zh_hans: 添加规划课程

source: Add Quarter
zh_hans: 添加学期

source: Add remaining assignments and confirm the grading policy to compare their course impact.
zh_hans: 添加剩余作业并确认评分规则后，即可比较它们对课程总评的影响。

source: Add start and end dates
zh_hans: 设置开始和结束日期

source: Add the first course for this quarter.
zh_hans: 为这个学期添加第一门课程。

source: Add the semester start and end dates before building its timeline.
zh_hans: 请先设置学期的开始和结束日期，再查看时间线。

source: Add your first item to start tracking scores.
zh_hans: 添加第一项作业或考试，开始记录成绩。

source: Add Your First Term
zh_hans: 添加第一个学期

source: Added bulk creation for assignments, exams, and labs.
zh_hans: 新增批量创建作业、考试和实验。

source: Added course templates for quickly reusing grading structures.
zh_hans: 新增课程模板，可快速复用课程评分结构。

source: Added local academic insights based on calculated course data.
zh_hans: 新增基于实际成绩计算的本地学业提示。

source: Additional units at 4.0 needed
zh_hans: 还需取得 4.0 的学分

source: Aggie GPA Backup
zh_hans: Aggie GPA 备份

source: Aggie GPA does not assume an official grading scale. Check your syllabus and enter your professor's category weights and letter-grade boundaries.
zh_hans: Aggie GPA 不会假设统一的官方评分线。请查看课程大纲，并输入教师采用的类别权重和字母成绩分界。

source: Aggie GPA is an unofficial student tool and is not affiliated with UC Davis.
zh_hans: Aggie GPA 是独立的学生工具，与 UC Davis 没有隶属关系。

source: Aggie GPA is locked
zh_hans: Aggie GPA 已锁定

source: Aggie GPA never receives or stores biometric data. Authentication is performed by iOS.
zh_hans: Aggie GPA 不会接收或保存生物识别数据，验证完全由 iOS 处理。

source: Aggie GPA uses the UC Davis grade-point scale: A+ and A are both 4.0, and plus/minus grades differ by 0.3 except for A+. P, NP, S, U, I, IP, and NG are excluded from GPA estimates by default.
zh_hans: Aggie GPA 采用 UC Davis 成绩点：A+ 与 A 均为 4.0；除 A+ 外，加减等级相差 0.3。P、NP、S、U、I、IP 和 NG 默认不计入 GPA 估算。

source: AI Activity
zh_hans: 智能处理

source: AI Activity Detail
zh_hans: 正在处理请求，请稍候片刻。

source: AI analysis was unavailable. Local rule recognition created this review-only draft.
zh_hans: AI 分析暂不可用，已使用本地规则识别创建仅供确认的草稿。

source: AI analysis was unavailable. Using local rule recognition instead.
zh_hans: AI 分析暂不可用，正在改用本地规则识别。

source: All
zh_hans: 全部

source: All Courses
zh_hans: 全部课程

source: All courses here are Planning Only and never enter official records automatically.
zh_hans: 这里的课程均仅用于规划，绝不会自动加入正式记录。

source: All Types
zh_hans: 全部类型

source: Allow Assignment Summaries
zh_hans: 允许作业摘要

source: Allow Creating Drafts
zh_hans: 允许创建草稿

source: Allow Detailed Scores
zh_hans: 允许详细分数

source: Allow GPA Responses
zh_hans: 允许回答 GPA

source: Alternative grading rules conflict and require manual review.
zh_hans: 检测到互相冲突的替代评分规则，需要手动审核。

source: An assignment or exam cannot have negative points.
zh_hans: 作业或考试的分值不能为负数。

source: An assignment or exam has a percentage outside 0–100%.
zh_hans: 有一项作业或考试的百分比不在 0–100% 范围内。

source: An attendance policy is mentioned; confirm how it affects the grade.
zh_hans: 检测到出勤政策，请确认它如何影响成绩。

source: An exam draft is ready for confirmation in Aggie GPA.
zh_hans: 考试草稿已准备好，请在 Aggie GPA 中确认。

source: Analysis complete
zh_hans: 分析完成

source: Analysis confidence
zh_hans: 解析把握

source: Analysis details
zh_hans: 分析详情

source: Analysis Status
zh_hans: 分析状态

source: Analyze Again
zh_hans: 重新分析

source: Analyze Pasted Text
zh_hans: 分析粘贴的文本

source: Analyze Selected Syllabus
zh_hans: 分析所选课程大纲

source: Analyzing on this device
zh_hans: 正在本机分析

source: Analyzing section %lld of %lld
zh_hans: 正在分析第 %1$lld 部分，共 %2$lld 部分

source: Analyzing Syllabus
zh_hans: 正在分析课程大纲

source: Analyzing the grading structure
zh_hans: 正在分析评分结构

source: Answer from syllabus
zh_hans: 大纲依据

source: Answers use the syllabus saved for this course and show the source page.
zh_hans: 答案来自本课程已保存的大纲，并会标出来源页码。

source: App
zh_hans: 个人信息

source: App icon appearance
zh_hans: App 图标外观

source: App Intents
zh_hans: App 意图

source: App Preferences
zh_hans: 应用设置

source: Appearance
zh_hans: 外观

source: Apple Foundation Models is not used by this version.
zh_hans: 此版本不使用 Apple Foundation Models。

source: Apple Intelligence is not enabled.
zh_hans: Apple 智能尚未开启。

source: Apply Changes
zh_hans: 应用更改

source: Apply this scenario to official records?
zh_hans: 要将这个方案写入正式记录吗？

source: Apply to official records
zh_hans: 写入正式记录

source: Ask
zh_hans: 提问

source: Ask a question about this syllabus
zh_hans: 问问这份课程大纲

source: Ask about this syllabus
zh_hans: 询问这份课程大纲

source: Ask About This Syllabus
zh_hans: 询问课程大纲

source: Assessment weight
zh_hans: 评估权重

source: assessments
zh_hans: 项评估

source: Assign all items to a weighted category.
zh_hans: 请将所有项目分配到对应的加权类别。

source: Assignment
zh_hans: 作业

source: Assignment & Exam Reminders
zh_hans: 作业与考试提醒

source: Assignment deleted
zh_hans: 作业已删除

source: Assignment deleted. Undo is available.
zh_hans: 作业已删除。可以撤销。

source: Assignment Draft
zh_hans: 作业草稿

source: Assignment name
zh_hans: 作业名称

source: Assignment title is missing.
zh_hans: 缺少作业标题。

source: Assignments
zh_hans: 作业

source: Assignments & Exams
zh_hans: 作业与考试

source: Assignments and exams
zh_hans: 作业与考试

source: Assignments and Exams
zh_hans: 作业和考试

source: Assignments and scores in this category will be kept as unassigned work.
zh_hans: 删除分类后，其中的作业和分数会保留，并移至“未分类”中。

source: Assignments, exams, grades, and private notes are never copied.
zh_hans: 不会复制作业、考试、成绩或私人备注。

source: Assignments, grading rules, and forecasts for this course will be deleted. You can undo before leaving this screen.
zh_hans: 这门课的作业、评分规则和试算方案都会删除。离开此页面前可以撤销。

source: Assume %@
zh_hans: 试算成绩 %@

source: Assume %lld%% on remaining work
zh_hans: 剩余任务按 %lld%% 试算

source: Assumed grades
zh_hans: 试算成绩

source: Assumption preset
zh_hans: 试算方式

source: Assumptions stay separate from recorded scores and official grades.
zh_hans: 试算内容不会改动已记录分数或正式成绩。

source: At a 4.0 future GPA, your highest possible final GPA is %@.
zh_hans: 即使未来课程均达到 4.0，你的最终 GPA 最高也只能达到 %@。

source: Attempt number: %lld
zh_hans: 第 %lld 次修读

source: Attention Needed
zh_hans: 需要处理

source: Available Commands
zh_hans: 可用指令

source: Average GPA needed across your remaining future units
zh_hans: 剩余学分所需的平均 GPA

source: Backups and device security
zh_hans: 备份与设备安全

source: Based on graded work
zh_hans: 根据目前已评分的内容计算

source: Based on graded work · %@ graded
zh_hans: 根据已评分内容计算 · 已评分权重 %@

source: Best case
zh_hans: 最佳情况

source: Best Case
zh_hans: 最理想情况

source: Best possible
zh_hans: 最好结果

source: Biggest Opportunity
zh_hans: 最大提升机会

source: Breakdown
zh_hans: 构成

source: Browse Course Templates
zh_hans: 浏览课程模板

source: Build a Plan
zh_hans: 制定计划

source: Built-in Template
zh_hans: 内置模板

source: Busiest day: %@ · %@ assessments · %@ weight
zh_hans: 最忙的一天：%@ · %@ 项评估 · %@ 权重

source: Calculate Required Final Score
zh_hans: 计算期末所需分数

source: Calculate Target Course Grade
zh_hans: 计算课程目标成绩

source: Calculate what ${course} needs for ${targetPercentage} percent
zh_hans: 计算 ${course} 达到 ${targetPercentage} 分所需成绩

source: Calculate what ${course} needs for an A-minus
zh_hans: 计算 ${course} 达到 A− 所需的成绩

source: Calculation
zh_hans: 计算

source: Calculation Basis
zh_hans: 计算依据

source: Calculation details
zh_hans: 计算详情

source: Calculation Details
zh_hans: 计算详情

source: Calculations are planning estimates, not official academic records. Confirm your transcript, degree progress, and any special program rules with UC Davis or your academic advisor.
zh_hans: 计算结果仅供规划参考，并非正式学业记录。请向 UC Davis 或学业顾问核对成绩单、学位进度和任何项目特殊规则。

source: Can I submit homework late?
zh_hans: 可以迟交作业吗？

source: Cancel
zh_hans: 取消

source: Cancel Analysis
zh_hans: 取消分析

source: Categories
zh_hans: 成绩类别

source: categories below target
zh_hans: 个类别低于目标

source: Categories found
zh_hans: 找到的评分类别

source: Category
zh_hans: 类别

source: Category average %@ compared with target %@; based on %@ graded item(s).
zh_hans: 类别平均分 %@ 与目标 %@ 比较；依据 %@ 个已评分项目。

source: Category weight and this item's possible points produce an estimated course influence of %@.
zh_hans: 类别权重与该项目满分共同计算出约 %@ 的课程影响。

source: Category weights total %@, above 100%%.
zh_hans: 类别权重总和为 %@，超过 100%%。

source: Category weights total %@, below 100%%.
zh_hans: 类别权重总和为 %@，低于 100%%。

source: Changing a due date updates its reminder. Deleting an item cancels it. If permission is denied, the gradebook continues to work normally.
zh_hans: 更改截止时间会更新提醒，删除项目会取消提醒。即使拒绝权限，成绩册仍可正常使用。

source: Check Course Settings before relying on predictions.
zh_hans: 依赖预测前，请先检查课程设置。

source: Check the course setup first.
zh_hans: 请先检查课程设置。

source: Check the extracted source details
zh_hans: 请检查提取出的原文依据

source: Checking weights and grading rules
zh_hans: 正在检查权重和评分规则

source: Choose a course to keep its gradebook visible here.
zh_hans: 选择一门课程后，这里会持续显示它的成绩详情。

source: Choose a grade for this plan. It will update GPA Overview and Full Simulation.
zh_hans: 为此计划选择成绩；GPA 总览和完整模拟会同步更新。

source: Choose a grading method before relying on course calculations.
zh_hans: 请先设置评分方式，再参考课程计算结果。

source: Choose a PDF, photos, or scanned pages. Text-based PDFs keep their original text; no OCR is used.
zh_hans: 选择 PDF、相册图片或扫描页面。文字型 PDF 会保留原始文本；不使用 OCR。

source: Choose a projected grade; Current stays unchanged
zh_hans: 选择预计成绩；当前成绩不会改变

source: Choose a simple starting point. You can adjust details later in Course Settings.
zh_hans: 先选择一个简单模板，之后可在课程设置中调整细节。

source: Choose a syllabus or paste its grading section first.
zh_hans: 请先选择课程大纲，或粘贴其中的评分说明。

source: Choose another course
zh_hans: 选择其他课程

source: Choose from Photos
zh_hans: 从相册选择

source: Choose PDF or Image
zh_hans: 选择 PDF 或图片

source: Choose PDF, Image, or Text
zh_hans: 选择 PDF、图片或文本

source: Choose the course percentage you want, and we’ll show what you need on remaining work.
zh_hans: 选择想要达到的课程百分比，我们会计算剩余任务所需成绩。

source: Choose the courses this plan should include
zh_hans: 选择计划要包含的课程

source: Clear
zh_hans: 透明

source: Clear Demo Data
zh_hans: 清除演示数据

source: Clearer grading categories, weights, assessments, and special rules
zh_hans: 更清晰地识别评分类别、权重、细分项目和特殊规则

source: Clearer official and estimated GPA
zh_hans: 更清楚地区分正式 GPA 与预计 GPA

source: Clearer Today, Courses, and Course Detail experiences
zh_hans: 更清晰的今天、课程与课程详情体验

source: Clearer Today, global add, and course-detail flow
zh_hans: 更清晰的今天、添加入口和课程详情流程

source: Close
zh_hans: 关闭

source: Combining Sections
zh_hans: 正在整理多个部分

source: Community College
zh_hans: 社区大学

source: Compact status capsules used during indeterminate local work.
zh_hans: 本地处理时会显示紧凑的状态胶囊。

source: Compare saved grade plans
zh_hans: 比较已保存的成绩方案

source: Completed
zh_hans: 已完成

source: Completed weight
zh_hans: 已完成权重

source: Confidence
zh_hans: 置信度

source: Confidence %lld percent
zh_hans: 识别把握为百分之 %lld

source: Confirm & Add
zh_hans: 确认并添加

source: Confirm & Import
zh_hans: 确认并导入

source: Confirm and Save
zh_hans: 确认并保存

source: Confirm and Save Rules
zh_hans: 确认并保存规则

source: Confirm before missing items count as zero.
zh_hans: 缺交项目按 0 分计入前需要确认。

source: Confirm Import
zh_hans: 确认导入

source: Confirm Siri Draft
zh_hans: 确认 Siri 草稿

source: Confirm the imported grading policy before relying on predictions.
zh_hans: 请先确认导入的计分规则，再参考预计成绩。

source: Confirmed
zh_hans: 已确认

source: Confirmed drafts before Siri writes any grades
zh_hans: Siri 写入任何成绩前都需要确认草稿

source: Confirmed grading rules saved.
zh_hans: 已保存确认后的评分规则。

source: Conservative
zh_hans: 稳妥

source: Continue
zh_hans: 继续

source: Continue to Quick Add
zh_hans: 继续快速添加

source: Contribution
zh_hans: 对总评的贡献

source: Copy common grading settings
zh_hans: 复制常用评分设置

source: Copy Options
zh_hans: 复制选项

source: Copy reminder defaults for future items
zh_hans: 复制未来项目的提醒默认设置

source: Couldn’t clear demo data
zh_hans: 无法清除演示数据

source: Couldn’t complete that action
zh_hans: 无法完成此操作

source: Couldn’t create course
zh_hans: 无法创建课程

source: Couldn’t create items
zh_hans: 无法创建项目

source: Couldn’t create this plan.
zh_hans: 无法创建此计划。

source: Couldn’t save scenario.
zh_hans: 无法保存方案。

source: Couldn’t save this plan.
zh_hans: 无法保存此计划。

source: Count missing as zero
zh_hans: 缺交按零分计

source: Course
zh_hans: 课程

source: Course code
zh_hans: 课程代码

source: Course code, e.g. CHE 002A
zh_hans: 课程代码，例如 CHE 002A

source: Course deleted
zh_hans: 课程已删除

source: Course deleted. Undo is available.
zh_hans: 课程已删除。可以撤销。

source: Course detail
zh_hans: 课程详情

source: Course Grade
zh_hans: 课程成绩

source: Course grade calculator
zh_hans: 课程成绩计算器

source: Course impact
zh_hans: 对课程总评的影响

source: Course name
zh_hans: 课程名称

source: Course Settings
zh_hans: 课程设置

source: Course Templates
zh_hans: 课程模板

source: Course title
zh_hans: 课程名称

source: Course was not identified.
zh_hans: 未识别到课程。

source: Course weight
zh_hans: 课程权重

source: Course weights need review
zh_hans: 需要检查课程权重

source: Course, coursework, or quarter
zh_hans: 课程、作业或学期

source: Course, title, or quarter
zh_hans: 课程、名称或学期

source: Courses
zh_hans: 课程

source: Courses and scenarios
zh_hans: 课程与情景

source: Courses created from this template are not changed.
zh_hans: 使用此模板创建的课程不会修改原课程。

source: Courses to include
zh_hans: 要包含的课程

source: Create a course before adding work or scores.
zh_hans: 请先创建课程，再添加任务或录入分数。

source: Create a plan from GPA Overview to save its inputs.
zh_hans: 从 GPA 总览创建计划即可保存输入。

source: Create a quarter, then add courses and grades.
zh_hans: 先创建学期，再添加课程和成绩。

source: Create a term before adding a course.
zh_hans: 添加课程前，请先创建学期。

source: Create and Reuse
zh_hans: 创建与复用

source: Create Assignment Draft
zh_hans: 创建作业草稿

source: Create Course
zh_hans: 创建课程

source: Create Exam Draft
zh_hans: 创建考试草稿

source: Create from Template
zh_hans: 从模板创建

source: Create Items
zh_hans: 确认创建

source: Create Multiple
zh_hans: 批量创建

source: Create Plan
zh_hans: 创建计划

source: Create Snapshot and Reset
zh_hans: 创建快照并重置

source: Create the term for this course, then add your course.
zh_hans: 先创建本课程所属学期，再添加课程。

source: Cumulative GPA
zh_hans: 累计 GPA

source: Cumulative GPA %@
zh_hans: 累计 GPA %@

source: Cumulative, term, projected, and target
zh_hans: 累计、学期、预计与目标

source: Current
zh_hans: 当前

source: Current —
zh_hans: 当前 —

source: Current & Projected Grade
zh_hans: 当前成绩与预测成绩

source: Current %@ · Choose projected
zh_hans: 当前 %@ · 选择预计成绩

source: Current %@ · Projected %@
zh_hans: 当前 %@ · 预计 %@

source: Current %@%%
zh_hans: 当前 %@%%

source: Current %@%% · %@
zh_hans: 当前 %@%% · %@

source: Current calculated percentage: %@.
zh_hans: 当前计算百分比：%@。

source: Current course grade
zh_hans: 当前课程成绩

source: Current Course Grade
zh_hans: 当前课程成绩

source: Current course grade updated for %@.
zh_hans: %@ 当前课程成绩已更新。

source: Current earned course credit: %@; remaining weight: %@.
zh_hans: 当前已获得课程学分占比：%@；剩余权重：%@。

source: Current estimate; recorded GPA excludes NG and other non-GPA grades.
zh_hans: 当前为估算值；已记录 GPA 不包含 NG 和其他不计入 GPA 的成绩。

source: Current GPA
zh_hans: 当前 GPA

source: Current GPA %@
zh_hans: 当前 GPA %@

source: Current grade
zh_hans: 当前成绩

source: Current Grade
zh_hans: 当前成绩

source: Current grade unavailable
zh_hans: 当前成绩不可用
